#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.logging_bucket.random_id.this: Refreshing state... [id=SssY]
module.hackathon_bucket.random_id.this: Refreshing state... [id=kJkL]
module.config_bucket.random_id.this: Refreshing state... [id=aPbH]
module.postgres_backups_bucket.random_id.this: Refreshing state... [id=Ze9c]
module.remote_state_bucket.random_id.this: Refreshing state... [id=WvCN]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
module.database.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/database-policy]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
aws_sns_topic.expense_analysis_completions: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:expense-analysis-completions]
module.database.data.aws_iam_policy_document.ec2_assume_role: Reading...
module.personal.aws_iam_user.this: Refreshing state... [id=alex.jackson]
module.repositories["ticket-tracker"].aws_ecr_repository.this: Refreshing state... [id=ticket-tracker]
module.hackathon_bucket.aws_s3_bucket.this: Refreshing state... [id=hackathon-90990b]
module.logging_bucket.aws_s3_bucket.this: Refreshing state... [id=logging-4acb18]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
module.database.data.aws_iam_policy_document.ec2_assume_role: Read complete after 0s [id=2851119427]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=558855412466]
aws_sqs_queue.expense_analysis_completions: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/558855412466/expense-analysis-completions]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
aws_route53_zone.forkup: Refreshing state... [id=Z06686303IG6BF3DZ1HIL]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
module.remote_state_bucket.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-5af08d]
module.repositories["ticket-tracker"].aws_iam_user.builder: Refreshing state... [id=ticket-tracker-builder]
aws_sns_topic.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages]
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Reading...
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Read complete after 0s [id=2851119427]
module.postgres_backups_bucket.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-65ef5c]
module.database.aws_iam_role.this: Refreshing state... [id=database-role]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
module.personal.aws_iam_access_key.this: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
module.personal.aws_iam_user_login_profile.this: Refreshing state... [id=alex.jackson]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
module.repositories["ticket-tracker"].aws_iam_access_key.builder: Refreshing state... [id=AKIAYEHTA3LZAHS7ZJVQ]
module.repositories["ticket-tracker"].aws_iam_user_policy.builder: Refreshing state... [id=ticket-tracker-builder:ticket-tracker-builder-policy]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
module.secondary.aws_iam_role.this: Refreshing state... [id=secondary-role]
aws_sns_topic_subscription.expense_analysis_completions: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:expense-analysis-completions:99889508-405a-4819-ad5e-d178d1865649]
aws_iam_policy.forkup_dev_policy: Refreshing state... [id=arn:aws:iam::558855412466:policy/forkup-dev-policy]
aws_sns_topic_subscription.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages:c15a0919-9e06-484e-bef6-08ab63e662d8]
aws_iam_role.forkup_dev: Refreshing state... [id=forkup-dev]
module.database.aws_iam_instance_profile.this: Refreshing state... [id=database-instance-profile]
module.database.aws_iam_role_policy_attachment.this: Refreshing state... [id=database-role-20231230120447701700000002]
module.personal.aws_iam_user_policy.this: Refreshing state... [id=alex.jackson:alex.jackson.policy]
module.secondary.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/secondary-policy]
module.secondary.aws_iam_instance_profile.this: Refreshing state... [id=secondary-instance-profile]
aws_iam_role_policy_attachment.forkup_dev: Refreshing state... [id=forkup-dev-20250525170906426100000001]
module.secondary.aws_iam_role_policy_attachment.this: Refreshing state... [id=secondary-role-20250719114420150500000001]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.secondary.data.aws_subnet.self: Reading...
module.database.aws_ebs_volume.this: Refreshing state... [id=vol-0ac43ea68879b3895]
module.secondary.aws_security_group.this: Refreshing state... [id=sg-082c1d4eb6c73a96b]
module.database.aws_security_group.this: Refreshing state... [id=sg-0998f7db6e1ffb7eb]
module.database.data.aws_subnet.self: Reading...
module.logging_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=logging-4acb18]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.secondary.data.aws_subnet.self: Read complete after 1s [id=subnet-07936cc0e5c7d83b1]
module.hackathon_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=hackathon-90990b]
module.database.data.aws_subnet.self: Read complete after 1s [id=subnet-07936cc0e5c7d83b1]
module.database.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1983782041]
module.database.aws_security_group_rule.allow_inbound_postgres: Refreshing state... [id=sgrule-3465932672]
module.database.aws_instance.this: Refreshing state... [id=i-0e48bcc2a0d16252e]
module.database.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-1306823711]
module.database.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3173870365]
module.secondary.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1605379657]
module.secondary.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1114985806]
module.secondary.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-15600419]
module.secondary.aws_instance.this: Refreshing state... [id=i-04dd6150c72ec2de3]
module.secondary.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-3140163285]
module.secondary.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-560611136]
module.secondary.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-3441080191]
module.secondary.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3212432495]
module.remote_state_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_security_group_rule.allow_inbound_connections_from_secondary: Refreshing state... [id=sgrule-2115290846]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
module.postgres_backups_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-65ef5c]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.database.aws_volume_attachment.this: Refreshing state... [id=vai-3516952077]
module.secondary.aws_eip.this: Refreshing state... [id=eipalloc-0090590800db2505c]
aws_route53_record.forkup_records[""]: Refreshing state... [id=Z06686303IG6BF3DZ1HIL__A]
aws_route53_record.records["today"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_today_A]
aws_route53_record.records[""]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
aws_route53_record.records["uptime"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_uptime_A]
aws_route53_record.records["tags"]: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_tags_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.database will be created
  + resource "aws_route53_record" "database" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "postgres"
      + records         = [
          + "10.0.0.238",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.internal will be created
  + resource "aws_route53_zone" "internal" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "mesh.internal"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>